---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplittingCurvesWithMultipleNeighbors
source: html/a92c8d26-83f3-3bdd-943f-6cf63f30e41a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplittingCurvesWithMultipleNeighbors Property

A point cannot coincide with end points of more than two curve elements. All curve elements adjacent to such a point are ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSplittingCurvesWithMultipleNeighbors { get; }
```